import stringsimilarity.Cosine;
import stringsimilarity.Jaccard;
import stringsimilarity.JaroWinkler;
import stringsimilarity.SorensenDice;

import java.util.ArrayList;

class StringSimilarityTest {

    public static void main(String[] args) {

//        String dua = "الحمد لله الذي أحيانا بعد ما أماتنا، وإليه النشور";
//
//        String test1 = "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا أراد أن ينام قال \u200F\u200F باسمك اللهم أموت وأحيا \u200F\"\u200F\u200F.\u200F وإذا استيقظ من منامه قال \u200F\"\u200F الحمد لله الذي أحيانا بعد ما أماتنا، وإليه النشور \u200F\"\u200F\u200F.\u200F\"";
//
//        String test2 = "حدثني موسى بن إسماعيل، حدثنا أبو عوانة، عن عبد الملك، عن ربعي، عن حذيفة ـ رضى الله عنه قال كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل وضع يده تحت خده ثم يقول \u200F\u200F اللهم باسمك أموت وأحيا \u200F\"\u200F\u200F.\u200F وإذا استيقظ قال \u200F\"\u200F الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور \u200F\"\u200F\u200F.\u200F\"";
//
//        String test4 = "\u200F سيد الاستغفار اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أبوء لك بنعمتك، وأبوء لك بذنبي، فاغفر لي، فإنه لا يغفر الذنوب إلا أنت، أعوذ بك من شر ما صنعت\u200F.\u200F إذا قال حين يمسي فمات دخل الجنة ـ أو كان من أهل الجنة ـ وإذا قال حين يصبح فمات من يومه \u200F\"";
//
//        String test3 = "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الله بن أبي السفر، عن أبي بكر بن أبي موسى، عن البراء، أن النبي صلى الله عليه وسلم كان إذا أخذ مضجعه قال \u200F\u200F اللهم باسمك أحيا وباسمك أموت \u200F\"\u200F \u200F.\u200F وإذا استيقظ قال \u200F\"\u200F الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور \u200F\"\u200F \u200F.\u200F\"";
//
//
//        String test5 = "أخبرنا العباس بن محمد، قال أنبأنا أبو نوح، قال حدثنا جرير بن حازم، عن عبد الملك بن عمير، عن إياد بن لقيط، عن أبي رمثة، قال خرج علينا رسول الله صلى الله عليه وسلم وعليه ثوبان أخضران \u200F.\u200F";


        //dua 328 id
        String dua = "اذهب الباس رب الناس واشف انت الشافي لا شفاء الا شفاءك شفاء لا يغادر سقما";

        String test1 = "حدثنا زهير بن حرب واسحاق بن ابراهيم قال اسحاق اخبرنا وقال زهير  واللفظ له  حدثنا جرير عن الاعمش عن ابي الضحي عن مسروق عن عاءشه قالت كان رسول الله صلي الله عليه وسلم اذا اشتكي منا انسان مسحه بيمينه ثم قال \u200F\u200F اذهب الباس رب الناس واشف انت الشافي لا شفاء الا شفاءك شفاء لا يغادر سقما \u200F\u200F \u200F\u200F فلما مرض رسول الله صلي الله عليه وسلم وثقل اخذت بيده لاصنع به نحو ما كان يصنع فانتزع يده من يدي ثم قال \u200F\u200F اللهم اغفر لي واجعلني مع الرفيق الاعلي \u200F\u200F \u200F\u200F قالت فذهبت انظر فاذا هو قد قضي \u200F\u200F";
        String test2 = "\u200F اذهب الباس رب الناس اشفه انت الشافي لا شفاء الا شفاءك شفاء لا يغادر سقما \u200F";
        String test3 = "وحدثناه ابو بكر بن ابي شيبه وزهير بن حرب قالا حدثنا جرير عن منصور عن ابي الضحي عن مسروق عن عاءشه قالت كان رسول الله صلي الله عليه وسلم اذا اتي المريض يدعو له قال \u200F\u200F اذهب الباس رب الناس واشف انت الشافي لا شفاء الا شفاءك شفاء لا يغادر سقما \u200F\u200F \u200F\u200F وفي روايه ابي بكر فدعا له وقال \u200F\u200F وانت الشافي \u200F\u200F \u200F\u200F";
        String test4 = "\u200F اذهب الباس رب الناس واشف انت الشافي لا شفاء الا شفاءك شفاء لا يغادر سقما \u200F";
        String test5 = "حدثنا ابو بكر بن ابي شيبه حدثنا ابو معاويه عن الاعمش عن مسلم عن مسروق عن عاءشه قالت كان النبي  صلي الله عليه وسلم  يتعوذ بهءلاء الكلمات \u200F\u200F اذهب الباس رب الناس \u200F\u200F واشف انت الشافي لا شفاء الا شفاءك شفاء لا يغادر سقما \u200F\u200F \u200F\u200F فلما ثقل النبي  صلي الله عليه وسلم  في مرضه الذي مات فيه اخذت بيده فجعلت امسحه واقولها \u200F\u200F فنزع يده من يدي ثم قال \u200F\u200F اللهم اغفر لي والحقني بالرفيق الاعلي \u200F\u200F \u200F\u200F قالت فكان هذا اخر ما سمعت من كلامه  صلي الله عليه وسلم  \u200F\u200F";


//dua 31
//        String dua = "الحمد لله الذي كساني هذا الثوب ورزقنيه من غير حول مني ولا قوه";
//
//        String test = "وحدثنا محمد بن المثني حدثنا يزيد اخبرنا الجريري بهذا الاسناد نحوه غير انه قال وكان اهل مكه قوم حسد \u200F\u200F ولم يقل يحسدونه \u200F\u200F";
//        String test1 = "وحدثنا قتيبه بن سعيد حدثنا حاتم بهذا الاسناد \u200F\u200F غير انه قال في كلتيهما سبع غزوات \u200F\u200F";
//        String test3 = "وحدثني زهير بن حرب حدثنا جرير ح وحدثنا قتيبه حدثنا عبد العزيز  يعني الدراوردي  كلاهما عن سهيل بهذا الاسناد \u200F\u200F";
//        String test4 = "وحدثنيه محمد بن عبد الله بن قهزاذ حدثني عبد الله بن عثمان عن عبد الله بن المبارك عن يونس عن الزهري بهذا الاسناد مثله \u200F\u200F";
//        String test5 = "قال ابو اسحاق ابراهيم بن محمد حدثنا محمد بن يحيي حدثنا ابن ابي مريم حدثنا ابو غسان حدثنا زيد بن اسلم عن عطاء بن يسار \u200F\u200F وذكر الحديث نحوه \u200F\u200F";

        //31
//        String dua =
//        "I heard Allah's Messenger (ﷺ) saying, \"The reward of deeds depends upon the intentions and every person will get the reward according to what he has intended. So whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for.";
//
//        String test1 = "Allah's Messenger (ﷺ) said, \"The reward of deeds depends upon the intention and every person will get the reward according to what he has intended. So whoever emigrated for Allah and His Apostle, then his emigration was for Allah and His Apostle. And whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for.";
//        String test2 = "The Prophet (ﷺ) said, 'O people! The reward of deeds depends upon the intentions, and every person will get the reward according to what he has intended. So, whoever emigrated for Allah and His Apostle, then his emigration was for Allah and His Apostle, and whoever emigrated to take worldly benefit or for a woman to marry, then his emigration was for what he emigrated for.\"";
//
//        String test3 = "وحدثني زهير بن حرب حدثنا جرير ح وحدثنا قتيبه حدثنا عبد العزيز  يعني الدراوردي  كلاهما عن سهيل بهذا الاسناد \u200F\u200F";
//        String test4 = "وحدثنيه محمد بن عبد الله بن قهزاذ حدثني عبد الله بن عثمان عن عبد الله بن المبارك عن يونس عن الزهري بهذا الاسناد مثله \u200F\u200F";
//        String test5 = "قال ابو اسحاق ابراهيم بن محمد حدثنا محمد بن يحيي حدثنا ابن ابي مريم حدثنا ابو غسان حدثنا زيد بن اسلم عن عطاء بن يسار \u200F\u200F وذكر الحديث نحوه \u200F\u200F";


        //long hadiths
//                String dua = "حدثنا يحيي بن بكير قال حدثنا الليث عن عقيل عن ابن شهاب عن عروه بن الزبير عن عاءشه ام المءمنين انها قالت اول ما بدء به رسول الله صلي الله عليه وسلم من الوحي الرءيا الصالحه في النوم فكان لا يري رءيا الا جاءت مثل فلق الصبح ثم حبب اليه الخلاء وكان يخلو بغار حراء فيتحنث فيه  وهو التعبد  الليالي ذوات العدد قبل ان ينزع الي اهله ويتزود لذلك ثم يرجع الي خديجه فيتزود لمثلها حتي جاءه الحق وهو في غار حراء فجاءه الملك فقال اقرا\u200F\u200F قال \u200F\u200F ما انا بقارء \u200F\u200F\u200F\u200F قال \u200F\u200F فاخذني فغطني حتي بلغ مني الجهد ثم ارسلني فقال اقرا\u200F\u200F قلت ما انا بقارء\u200F\u200F فاخذني فغطني الثانيه حتي بلغ مني الجهد ثم ارسلني فقال اقرا\u200F\u200F فقلت ما انا بقارء\u200F\u200F فاخذني فغطني الثالثه ثم ارسلني فقال \u200F\u200Fاقرا باسم ربك الذي خلق  خلق الانسان من علق  اقرا وربك الاكرم\u200F\u200F \u200F\u200F\u200F\u200F فرجع بها رسول الله صلي الله عليه وسلم يرجف فءاده فدخل علي خديجه بنت خويلد رضي الله عنها فقال \u200F\u200F زملوني زملوني \u200F\u200F\u200F\u200F فزملوه حتي ذهب عنه الروع فقال لخديجه واخبرها الخبر \u200F\u200F لقد خشيت علي نفسي \u200F\u200F\u200F\u200F فقالت خديجه كلا والله ما يخزيك الله ابدا انك لتصل الرحم وتحمل الكل وتكسب المعدوم وتقري الضيف وتعين علي نواءب الحق\u200F\u200F فانطلقت به خديجه حتي اتت به ورقه بن نوفل بن اسد بن عبد العزي ابن عم خديجه  وكان امرا تنصر في الجاهليه وكان يكتب الكتاب العبراني فيكتب من الانجيل بالعبرانيه ما شاء الله ان يكتب وكان شيخا كبيرا قد عمي  فقالت له خديجه يا ابن عم اسمع من ابن اخيك\u200F\u200F فقال له ورقه يا ابن اخي ماذا تري فاخبره رسول الله صلي الله عليه وسلم خبر ما راي\u200F\u200F فقال له ورقه هذا الناموس الذي نزل الله علي موسي صلي الله عليه وسلم يا ليتني فيها جذعا ليتني اكون حيا اذ يخرجك قومك\u200F\u200F فقال رسول الله صلي الله عليه وسلم \u200F\u200F اومخرجي هم \u200F\u200F\u200F\u200F قال نعم لم يات رجل قط بمثل ما جءت به الا عودي وان يدركني يومك انصرك نصرا مءزرا\u200F\u200F ثم لم ينشب ورقه ان توفي وفتر الوحي\u200F\u200F";
//
//        String test1 = "حدثنا عبد الله بن يوسف قال حدثنا الليث عن سعيد  هو المقبري  عن شريك بن عبد الله بن ابي نمر انه سمع انس بن مالك يقول بينما نحن جلوس مع النبي صلي الله عليه وسلم في المسجد دخل رجل علي جمل فاناخه في المسجد ثم عقله ثم قال لهم ايكم محمد والنبي صلي الله عليه وسلم متكء بين ظهرانيهم\u200F\u200F فقلنا هذا الرجل الابيض المتكء\u200F\u200F فقال له الرجل ابن عبد المطلب فقال له النبي صلي الله عليه وسلم \u200F\u200F قد اجبتك \u200F\u200F\u200F\u200F فقال الرجل للنبي صلي الله عليه وسلم اني ساءلك فمشدد عليك في المساله فلا تجد علي في نفسك\u200F\u200F فقال \u200F\u200F سل عما بدا لك \u200F\u200F\u200F\u200F فقال اسالك بربك ورب من قبلك الله ارسلك الي الناس كلهم فقال \u200F\u200F اللهم نعم \u200F\u200F\u200F\u200F قال انشدك بالله الله امرك ان نصلي الصلوات الخمس في اليوم والليله قال \u200F\u200F اللهم نعم \u200F\u200F\u200F\u200F قال انشدك بالله الله امرك ان نصوم هذا الشهر من السنه قال \u200F\u200F اللهم نعم \u200F\u200F\u200F\u200F قال انشدك بالله الله امرك ان تاخذ هذه الصدقه من اغنياءنا فتقسمها علي فقراءنا فقال النبي صلي الله عليه وسلم \u200F\u200F اللهم نعم \u200F\u200F\u200F\u200F فقال الرجل امنت بما جءت به وانا رسول من وراءي من قومي وانا ضمام بن ثعلبه اخو بني سعد بن بكر\u200F\u200F رواه موسي وعلي بن عبد الحميد عن سليمان عن ثابت عن انس عن النبي صلي الله عليه وسلم بهذا\u200F\u200F";
//
//        String test2 = "حدثنا مسدد قال حدثني يحيي بن سعيد قال حدثنا عوف قال حدثنا ابو رجاء عن عمران قال كنا في سفر مع النبي صلي الله عليه وسلم وانا اسرينا حتي كنا في اخر الليل وقعنا وقعه ولا وقعه احلي عند المسافر منها فما ايقظنا الا حر الشمس وكان اول من استيقظ فلان ثم فلان ثم فلان  يسميهم ابو رجاء فنسي عوف  ثم عمر بن الخطاب الرابع وكان النبي صلي الله عليه وسلم اذا نام لم يوقظ حتي يكون هو يستيقظ لانا لا ندري ما يحدث له في نومه فلما استيقظ عمر وراي ما اصاب الناس وكان رجلا جليدا فكبر ورفع صوته بالتكبير فما زال يكبر ويرفع صوته بالتكبير حتي استيقظ لصوته النبي صلي الله عليه وسلم فلما استيقظ شكوا اليه الذي اصابهم قال \u200F\u200F لا ضير  او لا يضير  ارتحلوا \u200F\u200F\u200F\u200F فارتحل فسار غير بعيد ثم نزل فدعا بالوضوء فتوضا ونودي بالصلاه فصلي بالناس فلما انفتل من صلاته اذا هو برجل معتزل لم يصل مع القوم قال \u200F\u200F ما منعك يا فلان ان تصلي مع القوم \u200F\u200F\u200F\u200F قال اصابتني جنابه ولا ماء\u200F\u200F قال \u200F\u200F عليك بالصعيد فانه يكفيك \u200F\u200F\u200F\u200F ثم سار النبي صلي الله عليه وسلم فاشتكي اليه الناس من العطش فنزل فدعا فلانا  كان يسميه ابو رجاء نسيه عوف  ودعا عليا فقال \u200F\u200F اذهبا فابتغيا الماء \u200F\u200F\u200F\u200F فانطلقا فتلقيا امراه بين مزادتين  او سطيحتين  من ماء علي بعير لها فقالا لها اين الماء قالت عهدي بالماء امس هذه الساعه ونفرنا خلوفا\u200F\u200F قالا لها انطلقي اذا\u200F\u200F قالت الي اين قالا الي رسول الله صلي الله عليه وسلم\u200F\u200F قالت الذي يقال له الصابء قالا هو الذي تعنين فانطلقي\u200F\u200F فجاءا بها الي النبي صلي الله عليه وسلم وحدثاه الحديث قال فاستنزلوها عن بعيرها ودعا النبي صلي الله عليه وسلم باناء ففرغ فيه من افواه المزادتين  او السطيحتين  واوكا افواههما واطلق العزالي ونودي في الناس اسقوا واستقوا\u200F\u200F فسقي من شاء واستقي من شاء وكان اخر ذاك ان اعطي الذي اصابته الجنابه اناء من ماء قال \u200F\u200F اذهب فافرغه عليك \u200F\u200F\u200F\u200F وهي قاءمه تنظر الي ما يفعل بماءها وايم الله لقد اقلع عنها وانه ليخيل الينا انها اشد ملاه منها حين ابتدا فيها فقال النبي صلي الله عليه وسلم \u200F\u200F اجمعوا لها \u200F\u200F\u200F\u200F فجمعوا لها من بين عجوه ودقيقه وسويقه حتي جمعوا لها طعاما فجعلوها في ثوب وحملوها علي بعيرها ووضعوا الثوب بين يديها قال لها \u200F\u200F تعلمين ما رزءنا من ماءك شيءا ولكن الله هو الذي اسقانا \u200F\u200F\u200F\u200F فاتت اهلها وقد احتبست عنهم قالوا ما حبسك يا فلانه قالت العجب لقيني رجلان فذهبا بي الي هذا الذي يقال له الصابء ففعل كذا وكذا فوالله انه لاسحر الناس من بين هذه وهذه\u200F\u200F وقالت باصبعيها الوسطي والسبابه فرفعتهما الي السماء  تعني السماء والارض  او انه لرسول الله حقا فكان المسلمون بعد ذلك يغيرون علي من حولها من المشركين ولا يصيبون الصرم الذي هي منه فقالت يوما لقومها ما اري ان هءلاء القوم يدعونكم عمدا فهل لكم في الاسلام فاطاعوها فدخلوا في الاسلام\u200F\u200F";
//
//        String test3 = "حدثنا اسماعيل حدثنا ابراهيم عن صالح بن كيسان عن ابن شهاب عن عبد الحميد بن عبد الرحمن بن زيد بن الخطاب عن محمد بن سعد عن ابيه قال استاذن عمر بن الخطاب  رضي الله عنه  علي رسول الله صلي الله عليه وسلم وعنده نسوه من قريش يسالنه ويستكثرنه عاليه اصواتهن علي صوته فلما استاذن عمر تبادرن الحجاب فاذن له النبي صلي الله عليه وسلم فدخل والنبي صلي الله عليه وسلم يضحك فقال اضحك الله سنك يا رسول الله بابي انت وامي فقال \u200F\u200F عجبت من هءلاء اللاتي كن عندي لما سمعن صوتك تبادرن الحجاب \u200F\u200F\u200F\u200F فقال انت احق ان يهبن يا رسول الله\u200F\u200F ثم اقبل عليهن فقال يا عدوات انفسهن اتهبنني ولم تهبن رسول الله صلي الله عليه وسلم فقلن انك افظ واغلظ من رسول الله صلي الله عليه وسلم\u200F\u200F قال رسول الله صلي الله عليه وسلم \u200F\u200F ايه يا ابن الخطاب والذي نفسي بيده ما لقيك الشيطان سالكا فجا الا سلك فجا غير فجك \u200F\u200F\u200F\u200Fحدثنا اسماعيل حدثنا ابراهيم عن صالح بن كيسان عن ابن شهاب عن عبد الحميد بن عبد الرحمن بن زيد بن الخطاب عن محمد بن سعد عن ابيه قال استاذن عمر بن الخطاب  رضي الله عنه  علي رسول الله صلي الله عليه وسلم وعنده نسوه من قريش يسالنه ويستكثرنه عاليه اصواتهن علي صوته فلما استاذن عمر تبادرن الحجاب فاذن له النبي صلي الله عليه وسلم فدخل والنبي صلي الله عليه وسلم يضحك فقال اضحك الله سنك يا رسول الله بابي انت وامي فقال \u200F\u200F عجبت من هءلاء اللاتي كن عندي لما سمعن صوتك تبادرن الحجاب \u200F\u200F\u200F\u200F فقال انت احق ان يهبن يا رسول الله\u200F\u200F ثم اقبل عليهن فقال يا عدوات انفسهن اتهبنني ولم تهبن رسول الله صلي الله عليه وسلم فقلن انك افظ واغلظ من رسول الله صلي الله عليه وسلم\u200F\u200F قال رسول الله صلي الله عليه وسلم \u200F\u200F ايه يا ابن الخطاب والذي نفسي بيده ما لقيك الشيطان سالكا فجا الا سلك فجا غير فجك \u200F\u200F\u200F\u200F";
//
//
//        String test4 = "حدثنا ابراهيم بن موسي قال اخبرنا هشام بن يوسف ان ابن جريج اخبرهم قال اخبرني ابو بكر بن ابي مليكه عن عثمان بن عبد الرحمن التيمي عن ربيعه بن عبد الله بن الهدير التيمي  قال ابو بكر وكان ربيعه من خيار الناس عما حضر ربيعه من عمر بن الخطاب  رضي الله عنه  قرا يوم الجمعه علي المنبر بسوره النحل حتي اذا جاء السجده نزل فسجد وسجد الناس حتي اذا كانت الجمعه القابله قرا بها حتي اذا جاء السجده قال يا ايها الناس انا نمر بالسجود فمن سجد فقد اصاب ومن لم يسجد فلا اثم عليه\u200F\u200F ولم يسجد عمر  رضي الله عنه\u200F\u200F وزاد نافع عن ابن عمر  رضي الله عنهما ان الله لم يفرض السجود الا ان نشاء\u200F\u200F";
//        String test5 = "حدثنا اسماعيل حدثنا ابراهيم عن صالح بن كيسان عن ابن شهاب عن عبد الحميد بن عبد الرحمن بن زيد بن الخطاب عن محمد بن سعد عن ابيه قال استاذن عمر بن الخطاب  رضي الله عنه  علي رسول الله صلي الله عليه وسلم وعنده نسوه من قريش يسالنه ويستكثرنه عاليه اصواتهن علي صوته فلما استاذن عمر تبادرن الحجاب فاذن له النبي صلي الله عليه وسلم فدخل والنبي صلي الله عليه وسلم يضحك فقال اضحك الله سنك يا رسول الله بابي انت وامي فقال \u200F\u200F عجبت من هءلاء اللاتي كن عندي لما سمعن صوتك تبادرن الحجاب \u200F\u200F\u200F\u200F فقال انت احق ان يهبن يا رسول الله\u200F\u200F ثم اقبل عليهن فقال يا عدوات انفسهن اتهبنني ولم تهبن رسول الله صلي الله عليه وسلم فقلن انك افظ واغلظ من رسول الله صلي الله عليه وسلم\u200F\u200F قال رسول الله صلي الله عليه وسلم \u200F\u200F ايه يا ابن الخطاب والذي نفسي بيده ما لقيك الشيطان سالكا فجا الا سلك فجا غير فجك \u200F\u200F\u200F\u200F";


        ArrayList<String> strings = new ArrayList<>();
        System.out.println(dua + "\n" + test1 + "\n" + test2);
        strings.add(test1);
        strings.add(test2);
        strings.add(test3);
        strings.add(test4);
        strings.add(test5);

        textSimilarityTest(dua, strings);


//        TextFilter stemmer = new PorterStemmer();
//        List<String> words = Arrays.asList(
//                "caresses",
//                "ponies",
//                "ties",
//                "caress",
//                "cats",
//                "feed",
//                "agreed",
//                "disabled",
//                "matting",
//                "mating",
//                "meeting",
//                "milling",
//                "messing",
//                "meetings"
//        );
//
//        List<String> result = stemmer.filter(words);
//        for (int i = 0; i < words.size(); ++i)
//        {
//            System.out.println(String.format("%s -> %s", words.get(i), result.get(i)));
//        }
//
//        StopWordRemoval filter = new StopWordRemoval();
//
//        filter.setRemoveNumbers(false);
//        filter.setRemoveXmlTag(false);
//
//        List<String> before = BasicTokenizer.doTokenize(dua);
//        List<String> after = filter.filter(before);
//
//        TextFilter filter1 = new PunctuationFilter();
//
//        List<String> after1 = filter1.filter(before);
//
//        System.out.println(dua);
//        System.out.println(before);
//        System.out.println(after);
//        System.out.println(after1);
    }

    public static void textSimilarityTest(String dua, ArrayList<String> strings) {
        // Sorensen-Dice
        // =============
//        System.out.println("\nSubsectionSimilar");
//        SubsectionSimilar ss = new SubsectionSimilar(3);
//
//        // AB BC CD DE DF FG
//        // 1  1  1  1  0  0
//        // 1  1  1  0  1  1
//        // => 2 x 3 / (4 + 5) = 6/9 = 0.6666
//        for (String test : strings) {
//            System.out.println(ss.similarity(dua, test));
//        }


        // Sorensen-Dice
        // =============
        System.out.println("\nSorensen-Dice");
        SorensenDice sd = new SorensenDice(2);

        // AB BC CD DE DF FG
        // 1  1  1  1  0  0
        // 1  1  1  0  1  1
        // => 2 x 3 / (4 + 5) = 6/9 = 0.6666
        for (String test : strings) {
            System.out.println(sd.similarity(dua, test));
        }

        // Cosine
        // ======
        System.out.println("\nCosine");
        Cosine cos = new Cosine(3);

        // ABC BCE
        // 1  0
        // 1  1
        // angle = 45°
        // => similarity = .71
        for (String test : strings) {
            System.out.println(cos.similarity(dua, test));
        }

//        System.out.println("\n");
//        cos = new Cosine(2);
//        // AB BA
//        // 2  1
//        // 1  1
//        // similarity = .95
//        for (String test : strings) {
//            System.out.println(cos.similarity(dua, test));
//        }

        // Jaccard index
        // =============
        System.out.println("\nJaccard");
        Jaccard j2 = new Jaccard(2);
        // AB BC CD DE DF
        // 1  1  1  1  0
        // 1  1  1  0  1
        // => 3 / 5 = 0.6
        for (String test : strings) {
            System.out.println(j2.similarity(dua, test));
        }

        // Jaro-Winkler
        // ============
        System.out.println("\nJaro-Winkler");
        JaroWinkler jw = new JaroWinkler();

        // substitution of s and t : 0.9740740656852722
        for (String test : strings) {
            System.out.println(jw.similarity(dua, test));
        }
//
//        // Levenshtein
//        // ===========
//        System.out.println("\nLevenshtein");
//        Levenshtein levenshtein = new Levenshtein();
//        for (String test : strings) {
//            System.out.println(levenshtein.distance(dua, test));
//        }
//
//        // Damerau
//        // =======
//        System.out.println("\nDamerau");
//        Damerau damerau = new Damerau();
//
//        // 1 substitution
//        for (String test : strings) {
//            System.out.println(damerau.distance(dua, test));
//        }
//
//        // Optimal String Alignment
//        // =======
//        System.out.println("\nOptimal String Alignment");
//        OptimalStringAlignment osa = new OptimalStringAlignment();
//
//        //Will produce 3.0
//        for (String test : strings) {
//            System.out.println(osa.distance(dua, test));
//        }
//
//
//        // Longest Common Subsequence
//        // ==========================
//        System.out.println("\nLongest Common Subsequence");
//        LongestCommonSubsequence lcs = new LongestCommonSubsequence();
//
//        // Will produce 4.0
//        for (String test : strings) {
//            System.out.println(lcs.distance(dua, test));
//        }
//
//        // Normalized Levenshtein
//        // ======================
//        System.out.println("\nNormalized Levenshtein");
//        NormalizedLevenshtein l = new NormalizedLevenshtein();
//        for (String test : strings) {
//            System.out.println(l.distance(dua, test));
//        }
//
//        // QGram
//        // =====
//        System.out.println("\nQGram");
//        QGram dig = new QGram(2);
//
//        // AB BC CD CE
//        // 1  1  1  0
//        // 1  1  0  1
//        // Total: 2
//        for (String test : strings) {
//            System.out.println(dig.distance(dua, test));
//        }
//
//
//        System.out.println("\nFuzzy Score");
//        FuzzyScore score = new FuzzyScore(Locale.getDefault());
//
//        for (String test : strings) {
//            System.out.println(score.fuzzyScore(dua, test));
//        }
    }

}